{
  "scenes": {
    "start": {
      "description": "Welcome to A Miami Story! Here are some player controls:\n- Type the option's text to make a choice.\n- You'll have some options, but if you ever need a reminder, type 'help'. Choose the best option to reach BrainStation for Demo Day!\nGood luck!",
      "choices": [
        { "text": "start", "nextScene": "versaillesCafe" }
      ]
    },
    "versaillesCafe": {
      "description": "You're at Versailles Cafe at 8 am. It's a bright morning. And you have plenty of time, right?",
      "choices": [
        { "text": "walk", "nextScene": "walking", "hint": "Enjoy the fresh air and the scenic route." },
        { "text": "uber", "nextScene": "uber", "hint": "Ride in comfort with a driver." },
        { "text": "metrorail", "nextScene": "metrorail", "hint": "Use public transportation for a crowded but efficient journey." },
        { "text": "help", "nextScene": "help", "hint": "Get a reminder of the controls." }
      ]
    },
    "walking": {
      "description": "You've decided to walk to BrainStation. It's a long journey, but the weather is nice.",
      "choices": [
        { "text": "move", "nextScene": "continueWalking" }
      ]
    },
    "continueWalking": {
      "description": "So, you walk. And the streets of Miami teem with cars, and the smell of gasoline hits your nose. Suddenly, you hear a strange noise to your right.",
      "choices": [
        { "text": "look", "nextScene": "traffic" }
      ]
    },
    "traffic": {
      "description": "You feel like you've been walking for forever. You make it to 27th avenue, on Calle Ocho. But, just as you're about to cross the street, a loud smack of metal is heard to your right. You turn and see it.",
      "choices": [
        { "text": "look", "nextScene": "panic" }
      ]
    },
    "panic": {
      "description": "A pile-up has happened, cars are blocking the road, the streets are blistering hot. A standstill. You could always take a quick detour to get some water at a local bodega. Maybe that'll help you cool off.",
      "choices": [
        { "text": "move", "nextScene": "visitStore" }
      ]
    },
    "visitStore": {
      "description": "Everything in the store tightly packed together, packed shelves of random assortments of energy drinks, cigarette brands, and Takis variations. You pay for a bottle of water. And then, the rain starts. Like someone turned on a water faucet somewhere and forgot to turn it off. The rain is roaring now, the sun blotted out. You should wait, right?",
      "choices": [
        { "text": "look", "nextScene": "stillInStore" }
      ]
    },
    "stillInStore": {
      "description": "You wait. And wait. You buy chips, an energy drink. The rain is still going strong. You should probably wait some more, right?",
      "choices": [
        { "text": "look", "nextScene": "stillInTheStore" }
      ]
    },
    "stillInTheStore": {
      "description": "What should have been a five-minute visit to the store is now three hours later. The rain has not let up. You can't wait any longer. You'll keep on walking.",
      "choices": [
        { "text": "move", "nextScene": "inTheRain" }
      ]
    },
    "inTheRain": {
      "description": "The rain is pouring now, and you can feel the cold air impeding your progress. You're closer to the bridge leading into Wynwood. It is 1 pm.",
      "choices": [
        { "text": "move", "nextScene": "stillWalking" }
      ]
    },
    "stillWalking": {
      "description": "Just as you're about to start crossing over the bridge, the bridge alarm starts going off. The bridge is going up, and the rain is still pouring. You see a hundred yachts on the horizon.",
      "choices": [
        { "text": "look", "nextScene": "timePasses" }
      ]
    },
    "timePasses": {
      "description": "The rain continues. The bridge is still up. It's 2 pm. More time passes. Finally, the bridge does down, and you can keep walking.",
      "choices": [
        { "text": "move", "nextScene": "demoDay1" }
      ]
    },
    "uber": {
      "description": "You've ordered an Uber to BrainStation. The driver is on their way.\n\n- Type the option's text to make a choice.\n- Choose the best option to reach BrainStation for Demo Day!",
      "choices": [
        { "text": "wait", "nextScene": "keepWaiting" }
      ]
    },
    "keepWaiting": {
      "description": "You picked the quickest option, but Miami traffic has no regard for human life, nor your time. You stare at your phone, but no notification so far. You look around you, the bakery slowly filling up with a gaggle of Miamians and tourists. You decide to head outside and wait near the coffee window.",
      "choices": [
        { "text": "wait", "nextScene": "moreWaiting" }
      ]
    },
    "moreWaiting": {
      "description": "A five-minute wait has turned into a loop of waiting. Your initial Uber ride canceled on you. The line outside of Versailles has grown into a frenzy. You keep waiting.",
      "choices": [
        { "text": "wait", "nextScene": "carRide" }
      ]
    },
    "carRide": {
      "description": "You enter the car. You were expecting some nice AC, but the smell of the dankest of dank weed has hit your nostrils. You could go out and get another car, but that means more waiting. So, you steel yourself forward. The driver stares straight ahead and does not wait for you to put on your seatbelt while he's putting pedal to the metal, trying to beat the crush of traffic on 27th street.",
      "choices": [
        { "text": "continue", "nextScene": "carPanic" }
      ]
    },
    "carPanic": {
      "description": "The uber is weaving in and out of lanes, and hey, you're making good progress. It's like in no time at all, you'll make it to the end. But, the car is weaving crazily. And you did waste an hour waiting....and getting dangerously close to other cars. Your head is swimming from the weed smell and the veering of the car, but you try to block it out. You're almost there.",
      "choices": [
        { "text": "continue", "nextScene": "bridge" }
      ]
    },
    "bridge": {
      "description": "The car finally stops weaving through traffic to make it to a red light, you're now on thirteenth avenue, just about to leave Calle Ocho/Little Havana. It should be smooth sailing now, right? But you notice your uber driver gripping the wheel very tight, and as you rumble along, you can see why: the north bridge is up. And traffic is at a standstill. No amount of weaving or dodging will change the reality you're in now: You're stuck in traffic.",
      "choices": [
        { "text": "wait", "nextScene": "waitForBridge" }
      ]
    },
    "waitForBridge": {
      "description": "The bridge is still up.",
      "choices": [
        { "text": "wait", "nextScene": "freeBridge" }
      ]
    },
    "freeBridge": {
      "description": "The bridge is down, and you are free to go...or in this case, your uber Driver can hightail it there. Hold on!",
      "choices": [
        { "text": "continue", "nextScene": "demoDay2" }
      ]
    },
    "metrorail": {
      "description": "You've decided to take the Metrorail to reach BrainStation. Should be easy, right? The public transport is usually crowded but efficient.\n\n- Type the option's text to make a choice.\n- Choose the best option to reach BrainStation for Demo Day!",
      "choices": [
        { "text": "enter", "nextScene": "easyCard" }
      ]
    },
    "easyCard": {
      "description": "You're outside Versailles, bro, and while you have time, time is not on your side. One free trolley ride, One hour has elapsed. You're at the Brickell metrorail station. Time to buy an EasyCard and ride.",
      "choices": [
        { "text": "enter", "nextScene": "metroRide" }
      ]
    },
    "metroRide": {
      "description": "High up in the sky, about 40 feet, the Metro car is running fast. People stare out the windows. You do, too. The downtown horizon shifts away, the skyscrapers, finished and unfinished, blurry in the distance.",
      "choices": [
        { "text": "enter", "nextScene": "stuck" }
      ]
    },
    "stuck": {
      "description": "And then, just as quickly as you're moving, the train slowly stops moving. The wheels stop running. The car is stuck on the middle of the track. No way to leave, and you feel the wind moving about the outside.",
      "choices": [
        { "text": "exit", "nextScene": "metroWaiting" }
      ]
    },
    "metroWaiting": {
      "description": "It's been thirty minutes. The metro car is still stuck. There's been one announcement, saying that things will be cleared up and moving soon. You hope. It is 1:30 pm.",
      "choices": [
        { "text": "exit", "nextScene": "metroMoving" }
      ]
    },
    "metroMoving": {
      "description": "A further twenty minutes later, with no updates over the intercom, you think you have no chance. Suddenly, a jolt, and you're moving again.",
      "choices": [
        { "text": "exit", "nextScene": "lastBus" }
      ]
    },
    "lastBus": {
      "description": "You're almost there. But time is rushing by. If you hurry, the bus should get you there. Hurry!",
      "choices": [
        { "text": "enter", "nextScene": "demoDay3" }
      ]
    },
    "demoDay1": {
      "description": "-Congratulations! You've made it to BrainStation for Demo Day, even though the rain made a mess of things! Dry off and get ready: The event starts at 3 pm.",
      "choices": []
    },
    "demoDay2": {
      "description": "-Congratulations! It is now 2:59 pm, but you made it to Brainstation's Demo Day. Your nerves may be shaky from the Uber-ing, but you made it!",
      "choices": []
    },
    "demoDay3": {
      "description": "-Congratulations! You made it, a few minutes, give or take. But you made it to Brainstation's Demo Day. Drink some water, stretch, and check out all the cool projects!",
      "choices": []
    },
    "help": {
      "description": "-Welcome to A Miami Story! Here are some player controls:\n- Type the option's text to make a choice.\n- Choose the best option to reach BrainStation for Demo Day!\nGood luck!\n\n- Type 'back' to return to the previous scene.",
      "choices": [
        { "text": "back", "nextScene": "versaillesCafe" }
      ]
    }
  }
}
